return {
	"goolord/alpha-nvim",
	event = "VimEnter",
	config = function()
		local alpha = require("alpha")
		local dashboard = require("alpha.themes.dashboard")

		-- Set header
		dashboard.section.header.val = {
			"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀",
			"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⠐⢀⠠⡠⡰⡐⢔⠰⡡⡂⢄⢀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀",
			"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣜⢖⢜⢜⢜⢌⠆⡎⡪⡊⡆⡕⢅⢕⢌⠆⢄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀",
			"⠀⠀⠀⠀⠀⠀⠀⠀⡥⣜⢮⢢⢣⠱⡑⢵⣱⠡⡣⢹⢢⠣⡱⡨⠢⡣⡱⡐⠄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀",
			"⠀⠀⠀⠀⠀⠀⢀⠮⣯⡺⣵⠱⣕⢕⢍⢖⡌⣗⠜⡌⢞⡝⡼⡨⡣⡊⡢⡱⡑⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀",
			"⠀⠀⠀⠀⠀⠀⠆⢸⣪⢯⢞⣕⢵⡫⣗⡥⣝⢺⢸⢸⠨⣎⢯⡲⣜⠬⡢⡱⡨⡂⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀",
			"⠀⠀⠀⠀⠀⠀⠁⣸⣪⢯⢯⣚⢮⢺⣱⣝⡮⣯⢳⡫⡕⢜⣕⡇⡶⣫⡳⡨⠢⡪⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀",
			"⠀⠀⠀⠀⠀⠀⠀⠐⣗⣯⡳⡳⣹⢱⡳⡕⣯⡳⡕⣝⢮⢢⠳⡕⣏⢞⢼⢱⡑⢕⢄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀",
			"⠀⠀⠀⠀⠀⠀⠠⠀⢱⣳⣫⣟⢎⢇⢧⢫⡲⡕⡇⡗⣝⡆⡏⡮⢪⣫⣪⡗⣎⠪⢦⠂⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀",
			"⠀⠀⠀⠀⠀⠀⠀⠀⢸⢚⢮⡪⡎⡧⡳⡱⡣⡳⣱⢹⡚⡮⣣⢣⢣⡳⣵⣣⢣⢫⢸⢊⠄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀",
			"⠀⠀⠀⠀⠀⠀⠀⠀⡸⢀⣟⣞⡜⣎⢮⢣⡫⡺⣸⢢⢫⢯⡪⡎⡧⡇⡷⡳⣕⢣⣣⢫⡸⠀⡀⡄⡔⡔⡕⡕⣕⢥⢀⠀⠀⠀⠀⠀⠀⠀",
			"⠀⠀⠀⠀⠀⠀⠀⠀⡇⢰⣳⡳⡽⡜⣜⢕⢵⢹⢜⢎⢇⢗⢧⢳⡕⡇⣟⢽⣪⢗⣞⠾⡔⡝⣜⢜⣜⢜⢜⢕⢇⢧⢣⡣⢄⠀⠀⠀⠀⠀",
			"⠀⠀⠀⠀⠀⠀⠀⠀⡇⢘⡮⡾⣕⢿⢜⡎⡧⣗⣗⢵⡹⣱⢝⢮⢮⣳⣝⣗⡽⡝⡜⣜⣜⡞⡮⡳⣕⢯⢮⡪⡪⡪⡪⡪⡕⠀⠀⠀⠀⠀",
			"⠀⠀⠀⠀⠀⠀⠀⠀⡇⡯⣞⡽⡮⣫⢗⣗⠱⠑⣗⣗⡝⣜⢮⢧⡳⣷⣳⣗⣗⢷⢽⡞⡎⡯⡹⡹⡸⡩⡣⡣⡣⡣⡣⡣⣓⠀⠀⠀⠀⠀",
			"⠀⠀⠀⠀⠀⠀⠀⠀⡅⡯⣮⡻⡮⡳⡯⣺⡂⢃⠈⠺⣺⣺⢷⢝⣞⣮⣳⣳⣺⢽⣫⢮⢮⠮⢮⢪⣪⡪⡪⡪⡳⡹⡪⡪⡲⡀⠀⠀⠀⠀",
			"⠀⠀⠀⠀⠀⠀⠀⠀⣝⡽⣺⣺⠑⢯⣻⡪⡇⠀⢂⣴⣟⣗⡿⣽⣺⢞⣞⣮⡫⣏⢇⣇⡧⣯⡺⣜⢜⢮⢫⢗⡵⣕⢵⢱⢱⢡⠀⠀⠀⠀",
			"⠀⠀⠀⠀⠀⠀⠀⠀⣞⡽⣺⠊⠀⢹⣜⢺⢅⢰⣟⣗⡷⡯⣯⢷⡯⣟⢾⣺⣞⢽⢚⢜⢜⢜⢎⢾⢾⣺⣞⢾⣺⣪⢯⣎⢎⢎⠆⠀⠀⠀",
			"⠀⠀⠀⠀⠀⠀⠀⠀⣗⡯⡗⠀⡂⠀⢗⡅⣟⣯⢷⡯⡿⡽⣞⣯⢿⢽⢝⣗⣵⢱⢱⡗⡕⡕⡕⡕⡭⣳⢽⢽⣺⣺⣝⣎⢇⢯⠀⠀⠀⠀",
			"⠀⠀⠀⠀⠀⠀⠀⠀⡧⣟⠀⠐⠀⡀⠸⣝⣽⢾⢯⣟⡯⣟⢷⢽⢯⢯⣻⡺⣺⢜⡜⡎⡎⡎⡎⡎⡎⡎⡯⣟⣞⣞⣜⢞⡜⡆⠀⠀⠀⠀",
			"⠀⠀⠀⠀⠀⠀⠀⢠⣹⡕⠀⠀⠘⡄⠀⠱⣯⣻⢽⣳⢯⢯⣻⡽⣳⢽⣺⢽⢵⢫⢪⢪⢪⢪⢪⠪⡎⡎⡺⣽⣺⣺⣺⡳⡇⠀⠀⠀⠀⠀",
			"⠀⠀⠀⠀⠀⠀⠀⢸⣺⠂⠡⠀⠀⠘⠄⡰⣳⢯⣻⣺⢽⣻⢮⢯⢾⢽⣺⢽⣺⣕⢕⢕⢵⢱⢱⢱⢱⢱⢱⣻⣺⣺⣺⠚⠁⠀⠀⠀⠀⠀",
		}

		-- Set menu
		dashboard.section.buttons.val = {
			dashboard.button("f", "󰈞  Find file", ":Telescope find_files <CR>"),
			dashboard.button("e", "󰙅  File tree", ":Neotree toggle<CR>"),
			dashboard.button("r", "󰋚  Recent files", ":Telescope oldfiles <CR>"),
			dashboard.button("g", "󰱼  Find text", ":Telescope live_grep <CR>"),
			dashboard.button("q", "󰩈  Quit", ":qa<CR>"),
		}

		-- Set footer
		dashboard.section.footer.val = "Dynasty 🔥🩸"

		-- Send config to alpha
		alpha.setup(dashboard.opts)

		-- Disable folding on alpha buffer
		vim.cmd([[autocmd FileType alpha setlocal nofoldenable]])
	end,
	dependencies = { "nvim-tree/nvim-web-devicons" },
}
