7zip
alsa-utils
audacity
base
base-devel
bc
bluez
bluez-utils
btop
cava
chromium
cifs-utils
dbeaver
discord
docker
docker-compose
efibootmgr
eslint
eza
fastfetch
firefox
fish
flatpak
freerdp
ghostscript
git
git-filter-repo
github-cli
golangci-lint
grub
gvim
helvum
hyprland
hyprlock
hyprpaper
hyprshot
inetutils
inotify-tools
intel-ucode
iwd
jdk17-openjdk
jp2a
jre-openjdk
keyd
kitty
less
linux
linux-firmware
mako
man-db
mdbook
mdbook-mermaid
nano
ncspot
neovim
net-tools
networkmanager
nfs-utils
nmap
nodejs
noto-fonts-cjk
noto-fonts-emoji
npm
nvidia-open
nvidia-settings
nvidia-utils
obsidian
openbsd-netcat
openssh
os-prober
pamixer
pavucontrol
pipewire
pipewire-alsa
pipewire-pulse
playerctl
postgresql
prettier
putty
python-pip
python-pipx
python-ruff
qbittorrent
ripgrep
rofi
rofimoji
rsync
selene
shellcheck
shfmt
smbclient
socat
sox
spotify-launcher
starship
steam
stow
stylua
sudo
syncthing
tailscale
telegram-desktop
thunar
tmux
tree
tree-sitter-cli
ttf-hack-nerd
ttf-meslo-nerd
ttf-nerd-fonts-symbols-mono
typescript
typescript-language-server
unrar
unzip
uwsm
vulkan-nouveau
waybar
wev
wf-recorder
wget
wine
wiremix
wireplumber
wl-clipboard
wl-clip-persist
wtype
xdg-desktop-portal-hyprland
xdg-desktop-portal-wlr
yazi
ydotool
yt-dlp
zip
zsh
